## staging: create_metrics_lambda
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.create_metrics_put_s3 will be created
  + resource "aws_iam_policy" "create_metrics_put_s3" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "CovidAlertCreateMetricsPutItem"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObjectAcl",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::error-samples-snfsv-staging/*",
                          + "arn:aws:s3:::error-samples-snfsv-staging",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role_policy_attachment.createmetrics_s3_put will be created
  + resource "aws_iam_role_policy_attachment" "createmetrics_s3_put" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "create_lambda_role"
    }

  # aws_lambda_function.create_metrics will be updated in-place
  ~ resource "aws_lambda_function" "create_metrics" {
        id                             = "create_metrics"
      ~ last_modified                  = "2021-09-27T16:08:05.913+0000" -> (known after apply)
      ~ source_code_hash               = "aEd6pi0yMxotNZUmFx12rmB00nQF2zUIrM0fColWGy4=" -> "aIDB68u0fV6HGcz4vO+zz6aYUPoT6UI6+plHj1uzq28="
        tags                           = {}
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "BUCKET_NAME"     = "error-samples-snfsv-staging"
                # (2 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>